import { GlobalStateInterface, PreIntroFormInterface } from "./types";

export const initialState: GlobalStateInterface = {
    name: "",
    track: 0,
    scene: 0,
    preIntroForm: {} as PreIntroFormInterface,
    answers: {},
    formAnswers: [null, null, null, null],
    resultPage: 0,
    submitted: false,
};

export const delayInterval = 50;

export const introPlayInterval = 7500;

export const qList: { [key: string]: string } = {
    Q1_Deal:
        "รู้สึกกังวลที่จะต้องทำสิ่งที่เคยทำผิดพลาดมาก่อน เธอรับมือยังไงหรอ",
    Q2_Manage:
        "มีวิธีจัดการกับความไม่มั่นใจยังไงบ้าง เล่าให้ฉันฟังหน่อยได้มั้ย",
    Q3_Enough:
        "เคยเหรอ ลองเล่าให้ฟังหน่อยได้มั้ยว่าเพราะอะไรเธอถึงรู้สึกไม่ดีพอ ถึงแม้จะไม่มีใครกดดัน",
    Q4_Handle: "เธอรับมือกับความรู้สึกไม่ดีพอได้ยังไงเหรอ บอกฉันหน่อยได้มั้ย",
    Q5_Method: "เคยใช้วิธีจัดการกับความรู้สึกที่ไม่ดีพออะไรมาบ้างหรอ",
    Q6_NotWork: "แล้วเธอคิดว่าวิธีที่ทำไป ทำไมมันถึงยังไม่ได้ผลล่ะ",
    Q7_Alt: "ถ้าอย่างนั้นเราจะทำให้มันดีขึ้นได้ยังไงบ้าง หรือพอมีวิธีอื่นอีกไหมที่เธอคิดว่ามันอาจจะช่วยได้",
    Q8_How: "เก่งจังเลย บอกฉันหน่อยสิว่าเธอทำยังไงถึงไม่เคยรู้สึกไม่ดีพอเลย",
    Q9_Parent:
        "อยากเล่าเรื่องราวที่เคยได้รับความคาดหวังจากพ่อเเม่ให้พวกเราฟังบ้างมั้ย",
    Q10_Support:
        "เธอพอจะมีอะไรที่พอใช้พึ่งพาใจได้มั้ย ไม่จำเป็นต้องเป็นคนก็ได้นะ จะเป็นท้องฟ้า ของอร่อย สิ่งของอย่างอื่นก็ได้หมดเลย",
};
